Revit 2027 API
ParameterMap.Erase Method
Removes a object with the specified key from the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	string key
)
Public Overridable Function Erase (
	key As String
) As Integer
public:
virtual int Erase(
	String^ key
)
abstract Erase :
        key : string -> int
override Erase :
        key : string -> int
Parameters
key String
The key of the item to be erased.
Return Value
Int32
The number of items that were erased from the map.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace